In [5]:
from pandas import Series, DataFrame
import pandas as pd

In [12]:
data = DataFrame({'name':['kim','lee','park','kang','choi','hong'],
                  'score':[3.5,4.2,4.1,3.8,4.2,4.2]})

In [13]:
data.duplicated('score')

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [15]:
data.drop_duplicates('score',keep = 'first')
# 중복되는 데이터중 가장 위쪽 데이터만 남겨둔다  중복되는 모든 데이터 삭제

   name  score
0   kim    3.5
1   lee    4.2
2  park    4.1
3  kang    3.8

In [17]:
data.drop_duplicates('score',keep = 'last')
# 중복되는 데이터중 가장 마지막 데이터만 남겨둔다 중복되는 모든 데이터 삭제

   name  score
0   kim    3.5
2  park    4.1
3  kang    3.8
5  hong    4.2

In [20]:
df1 = DataFrame({'key':['a','a','b','c','b','b'],
                'data2':range(6)})

In [22]:
df2= DataFrame({'key':['a','b','d'],
                'data2':range(3)})

In [23]:
df1

  key  data2
0   a      0
1   a      1
2   b      2
3   c      3
4   b      4
5   b      5

In [31]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [26]:
pd.merge(df1,df2,on='key')

  key  data2_x  data2_y
0   a        0        0
1   a        1        0
2   b        2        1
3   b        4        1
4   b        5        1

In [28]:
pd.merge(df1,df2,how='outer')

  key  data2
0   a      0
1   a      1
2   b      2
3   c      3
4   b      4
5   b      5
6   b      1
7   d      2